# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, 
# насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, 
# если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. 
# Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры.В ответе напишите 
# “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке


text = "пара-ра-рам рам-пам-папам па-ра-па-да"
text = text.split()
mult = set()
lst_of_wrds = ["а", "е", "и", "о", "у", "э", "ю", "я"]

def count_syllables(txt, lst, mult):
    for i in txt:
        count = 0
        for ch in i:
            if ch in lst:
                count +=1
        mult.add(count)
    return mult

def res(result):
    if len(result) == 1:
        print("Парам пам-пам")
    else:
        print("Па-пам")

res(count_syllables(text, lst_of_wrds, mult))
