// Задача 2: Получить от пользователя два числа и вывести в диалоговое окно сумму значений, 
// которые ввел пользователь, вывод должен выглядеть так (пример): 
// Результат сложения чисел 5 и 2 равен 7.

// const num = Number.parseInt(prompt("Enter first number:"));
// const num2 = Number.parseInt(prompt("Enter second number:"));
// // const num3 = Number.parseInt(prompt("Enter second number:"));

// alert(`Результат сложения чисел ${num} и ${num2} равен ${num + num2}.`);

// Задача 4: вывести на экран в диалоговом окне текст с сообщением 
// “Вам хорошо живется?”и кнопками «ОК», «Отмена», для чего необходимо использовать confirm.
// При нажатии на кнопку “ОК” вывести в диалоговом окне текст с сообщением “Тогда мы идем к вам!”.
// При нажатии на кнопку “Отмена” вывести в диалоговом окне текст с сообщением “Ну вы держитесь там!”.

// let answer = confirm("Вам хорошо живется?");
//     if (answer == 1) alert("Тогда мы идем к вам!");
//     else alert("Ну вы держитесь там!");

// confirm("Вам хорошо живется?") ? alert("Тогда мы идем к вам!") : alert("Ну вы держитесь там!");

// Задача 3

// arr = [2, 0, 10, 2, 8]
// alert(findMax(arr))
// function findMax(arr) {
//     let max = arr[0];
//     for (let i = 2; i < 5; i += 2) {
//         if (arr[i] > max) {
//             max = arr[i];
//         }
//     }
//     return max
// }
